[M_Sage_Raid MissionDefinition]
MissionDescription="Agras is a big beast, like everything on Pandora, it is slaughtered. Can you and your friends do it??<br><br>Boss Ngwatu was discovered by the magician Agran who used a powerful beast called Varacidus and it is unknown where the Boss is from. But this brutal murderer thought he was God. They believed that Ngu Thi was an impostor who wanted to usurp their god. He then killed Ngwata and revealed the true power of Varocida.."
TeaserText="Traveling alone is dangerous. out of."
